Revit 2027 API
ElectricalSystem.TrueCurrentPhaseA Property
 The TrueCurrentPhaseA value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TrueCurrentPhaseA { get; }
Public ReadOnly Property TrueCurrentPhaseA As Double
	Get
public:
property double TrueCurrentPhaseA {
	double get ();
}
member TrueCurrentPhaseA : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the TrueCurrentPhaseA value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace